
## :x: Apply Failed

[CI link](https://github.com/goda6565/portfolio/actions/runs/15206288653)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Refreshing state... [id=projects/portfolio-460206/locations/asia-northeast1/services/frontend-main]
module.cloudrun_service.google_cloud_run_v2_service_iam_member.public_access: Refreshing state... [id=projects/portfolio-460206/locations/asia-northeast1/services/frontend-main/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cloudrun_domain_map.google_cloud_run_domain_mapping.default will be created
  + resource "google_cloud_run_domain_mapping" "default" {
      + id       = (known after apply)
      + location = "asia-northeast1"
      + name     = "goodyfolio.com"
      + project  = "portfolio-460206"
      + status   = (known after apply)

      + metadata {
          + effective_annotations = (known after apply)
          + effective_labels      = {
              + "goog-terraform-provisioned" = "true"
            }
          + generation            = 0
          + namespace             = "portfolio-460206"
          + resource_version      = (known after apply)
          + self_link             = (known after apply)
          + terraform_labels      = {
              + "goog-terraform-provisioned" = "true"
            }
          + uid                   = (known after apply)
        }

      + spec {
          + certificate_mode = "AUTOMATIC"
          + route_name       = "frontend-main"
        }
    }

  # module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service will be updated in-place
  ~ resource "google_cloud_run_v2_service" "cloudrun_service" {
      - client                  = "gcloud" -> null
      - client_version          = "523.0.0" -> null
        id                      = "projects/portfolio-460206/locations/asia-northeast1/services/frontend-main"
        name                    = "frontend-main"
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Modifying... [id=projects/portfolio-460206/locations/asia-northeast1/services/frontend-main]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Modifications complete after 4s [id=projects/portfolio-460206/locations/asia-northeast1/services/frontend-main]
module.cloudrun_domain_map.google_cloud_run_domain_mapping.default: Creating...
╷
│ Error: Error waiting to create DomainMapping: resource is in failed state "Ready:False", message: com.google.net.rpc3.RpcException: Caller is not authorized to administer the domain goodyfolio.com. If you own goodyfolio.com, you can obtain authorization by verifying ownership of the domain, or any of its parent domains, via the Webmaster Central portal: https://www.google.com/webmasters/verification/verification?domain=. We recommend verifying ownership of the largest scope you wish to use with subdomains (eg. verify 'example.com' if you wish to map 'subdomain.example.com').
│ 
│   with module.cloudrun_domain_map.google_cloud_run_domain_mapping.default,
│   on ../../modules/cloudrun_domain_map/google_cloud_run_domain_mapping.tf line 1, in resource "google_cloud_run_domain_mapping" "default":
│    1: resource "google_cloud_run_domain_mapping" "default" {
│ 
╵
Releasing state lock. This may take a few moments...
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":35,"Program":"tfcmt","SHA1":"207a10c696d1a852cbf1e22feb2b190ad2743c2f","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->